// =============================================
// 3D: Circular Plate Cap Ø123.6 (shell 1 mm, height 5 mm)
// Version: 1.1
// Author: ChatGPT (OpenSCAD)
// =============================================

// ----------------------------
// Настройка точности
// ----------------------------
description = "";
version_str = "1.1";

// ----------------------------
// Комментарии по устройству модели
// ----------------------------
// Фрагменты:
// - base: полный колпак — круглая крышка толщиной top_th + цилиндрическая юбка высотой skirt_h
// - Внутренний паз формируется разницей цилиндров (контроль посадки через fit_extra_inner)
// - Наружный диск БЕЗ скругления кромок (по просьбе)

// ----------------------------
// Параметры модели (все размеры в мм)
// ----------------------------

radius_r = 1.5;              // целевой радиус округлений (1–2 мм по ТЗ)
mink_r = 2; 


cap_inner_d     = 166.5; // 76 - стакан, маленькая банка, 78.2 - кофейная кружка, 87 - чайная кружка, 125.1 - блюдце // внутренний диаметр колпака (посадка)
wall_th         = 1.0;     // толщина стенки (радиальная)
top_th          = 1.6;     // толщина крышки сверху
cap_height      = 8;       // общая наружная высота колпака
fit_extra_inner = 0.05;    // технологический запас внутрь (увеличение внутреннего Ø)
test_cut_d      = 15;      // диаметр вырезки в середине cap_inner_d - 

print_test_cut = false; // делать вырез в середине cap_inner_d - test_cut_d





use <../modules.scad>

$fn = 0;        // фиксированную сегментацию отключаем
$fa = 1;        // 5–8° обычно достаточно
$fs = 0.35;     // ≈ диаметр сопла (0.3–0.5 для сопла 0.4)
pin_fs = 0.25;  // чуть тоньше для штырей и отверстий

// Вычисляемые размеры
cap_inner_d_eff = cap_inner_d + 2*fit_extra_inner; // реальный внутренний Ø для печати
cap_outer_d     = cap_inner_d_eff + 2*wall_th;     // наружный Ø
skirt_h         = max(cap_height - top_th - mink_r - mink_r * 0.175, eps());  // высота юбки (без верхней крышки)

module cap_body(){
    difference(){
        // Плоский диск без скругления
        if (mink_r > 0) {
            translate([0, 0, mink_r])
                minkowski(){
                    cylinder(h=skirt_h, d=cap_outer_d-2*mink_r);
                    translate([0, 0, 0]) sphere(r=mink_r, $fs=pin_fs, $fa=6);
                }
        } else {
            cylinder(h=top_th, d=cap_outer_d);
        }
        // Вырез сверху
        translate([0, 0, top_th])
            cylinder(h=cap_height, d=cap_inner_d_eff);
        if (print_test_cut) {
            translate([0, 0, 0])
                cylinder(h=cap_height, d=cap_inner_d_eff - test_cut_d);
        }
    }
}

// ----------------------------
// Основная деталь
// ----------------------------
module base(){
    cap_body();
}

// ----------------------------
// ВЫВОД МОДЕЛИ
// ----------------------------
clip_for_fragments() base();
